user.load.test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 20
      arrivalRate: 200
scenarios:
  - flow:
      - get:
          url: "/api/users/getlist"
          withQueryParams:
            page: 5
            limit: 100
      # - post:
      #     url: "/api/users/add"
      #     json:
      #       name: "surya{{__VU}}elvino"
      #       email: "surya{{__VU}}@example.com"
      #       phonenumber: "082332333{{__VU}}"
      #       password: "12345678"
      #       role: "developer"